### Heroes Of Pymoli Data Analysis
* Of the 1163 active players, the vast majority are male (84%). There also exists, a smaller, but notable proportion of female players (14%).

* Our peak age demographic falls between 20-24 (44.8%) with secondary groups falling between 15-19 (18.60%) and 25-29 (13.4%).  
-----

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [2]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)
purchase_data.head(100)

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
95,95,Ilassast39,18,Male,164,Exiled Doomblade,1.63
96,96,Lisassala98,16,Male,56,Foul Titanium Battle Axe,2.92
97,97,Aiduecal76,20,Male,134,Undead Crusader,4.50
98,98,Chadossa89,23,Male,132,Persuasion,3.19
99,99,Haisrisuir60,23,Male,92,Final Critic,4.19

In [3]:
purchase_data.tail()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [4]:
purchase_data.describe()

       Purchase ID         Age     Item ID       Price
count   780.000000  780.000000  780.000000  780.000000
mean    389.500000   22.714103   91.755128    3.050987
std     225.310896    6.659444   52.697702    1.169549
min       0.000000    7.000000    0.000000    1.000000
25%     194.750000   20.000000   47.750000    1.980000
50%     389.500000   22.000000   92.000000    3.150000
75%     584.250000   25.000000  138.000000    4.080000
max     779.000000   45.000000  183.000000    4.990000

purchase_data[['SN','Age']]

purchase_data.iloc[row, column] ==> purchase_data.iloc[5:10,[1,2] ]
purchase_data.loc[row, column] ==> purchase_data.iloc[5:10,['SN','Age']]

In [5]:
purchase_data.iloc[5:10,[1,2] ]

            SN  Age
5      Yalae81   22
6    Itheria73   36
7  Iskjaskst81   20
8    Undjask33   22
9  Chanosian48   35

## Player Count

* Display the total number of players

In [6]:
purchase_data['SN'].nunique()

576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [7]:
#Run basic calculations to obtain number of unique items, average price, etc.
id_ = purchase_data['Item ID'].nunique()
Price_average = purchase_data['Price'].mean()
print(id_)
print(Price_average)

179
3.050987179487176

In [8]:
#Optional: give the displayed data cleaner formatting Ext2
pd.DataFrame({'Display':'Summary','Item ID':id_, 'Price(avg)':Price_average},index = [0])

   Display  Item ID  Price(avg)
0  Summary      179    3.050987

In [9]:
#Create a summary data frame to hold the results
summary_results = {'name':['Item ID','Price'],'summary':[179,3.050987179487176]}

summary_results = pd.DataFrame(summary_results,columns=['name','summary'])
print(summary_results)

      name     summary
0  Item ID  179.000000
1    Price    3.050987

In [10]:
#Optional: give the displayed data cleaner formatting
summary_results.head()

      name     summary
0  Item ID  179.000000
1    Price    3.050987

In [11]:
# Display the summary data frame
summary_results.describe()

          summary
count    2.000000
mean    91.025494
std    124.414740
min      3.050987
25%     47.038240
50%     91.025494
75%    135.012747
max    179.000000

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [12]:
uniq_players = purchase_data[['SN','Gender']].groupby(['SN','Gender']).count().reset_index()

In [13]:
gender_count = uniq_players['Gender'].value_counts()
gender_count

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [14]:
gender_df = pd.DataFrame(gender_count)
gender_df['Percentage'] = (gender_df['Gender'] / (gender_df['Gender'].sum())) *100
gender_df['Percentage'] = gender_df['Percentage'].map("{:,.2f}%".format)
gender_df

                       Gender Percentage
Male                      484     84.03%
Female                     81     14.06%
Other / Non-Disclosed      11      1.91%

In [15]:
Male_Players = purchase_data["Gender"].value_counts()
total_gender = Male_Players.sum()
perc_gender=Male_Players/total_gender *100

demo_df=pd.concat([perc_gender, Male_Players], axis=1)
demo_df.columns=["Percentage of Players", "Total Counts"]
demo_df["Percentage of Players"]=demo_df["Percentage of Players"].map("{:,.2f}%".format)
demo_df

                      Percentage of Players  Total Counts
Male                                 83.59%           652
Female                               14.49%           113
Other / Non-Disclosed                 1.92%            15

In [16]:
# This is just the count of all players
Male_Players = purchase_data['Gender'].count()
print(Male_Players)

780

In [17]:
#filter by male players
isMale = uniq_players['Gender'] == 'Male'
isMale

0       True
1      False
2       True
3       True
4       True
       ...
571    False
572     True
573    False
574     True
575     True
Name: Gender, Length: 576, dtype: bool

In [18]:
uniq_players[isMale]

               SN Gender
0    Adairialis76   Male
2          Aeda94   Male
3          Aela59   Male
4       Aelaria33   Male
5    Aelastirin39   Male
..            ...    ...
569       Yasur85   Male
570    Yathecal72   Male
572    Yathedeu43   Male
574    Zhisrisu83   Male
575     Zontibe81   Male

[484 rows x 2 columns]

In [19]:
uniq_players[uniq_players['Gender'] == 'Male']

               SN Gender
0    Adairialis76   Male
2          Aeda94   Male
3          Aela59   Male
4       Aelaria33   Male
5    Aelastirin39   Male
..            ...    ...
569       Yasur85   Male
570    Yathecal72   Male
572    Yathedeu43   Male
574    Zhisrisu83   Male
575     Zontibe81   Male

[484 rows x 2 columns]

In [20]:
# Percentage and Count of Male Players
Male_Players = purchase_data['Gender'].value_counts()
print(Male_Players)

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [21]:
gender_grpby = purchase_data[['Gender','Price']].groupby(['Gender'])
gender_grpby

In [22]:
purch_count = gender_grpby.count()
purch_count

                       Price
Gender
Female                   113
Male                     652
Other / Non-Disclosed     15

In [23]:
purch_sum = gender_grpby.sum()
purch_sum

                         Price
Gender
Female                  361.94
Male                   1967.64
Other / Non-Disclosed    50.19

In [24]:
purch_avg = gender_grpby.mean()
purch_avg

                          Price
Gender
Female                 3.203009
Male                   3.017853
Other / Non-Disclosed  3.346000

In [25]:
pd.DataFrame(gender_count)

                       Gender
Male                      484
Female                     81
Other / Non-Disclosed      11

In [26]:
gender_count

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [27]:
Sum_price = pd.DataFrame (purch_sum.Price / gender_count)
Sum_price

                              0
Female                 4.468395
Male                   4.065372
Other / Non-Disclosed  4.562727

In [28]:
resultDF = pd.concat([purch_count,purch_sum, purch_avg, Sum_price], axis = 1)
resultDF.columns = ['Total Purchases', 'Total Price', 'Avg. Purchase Price','Sum_price']
resultDF

,Total Purchases,Total Price,Avg. Purchase Price,Sum_price
Gender,,,,
Female,113,361.94,3.203009,4.468395
Male,652,1967.64,3.017853,4.065372
Other / Non-Disclosed,15,50.19,3.346000,4.562727

## Age Demographics

The below each broken into bins of 4 years (i.e. &lt;10, 10-14, 15-19, etc.)

* Purchase Count

* Average Purchase Price

* Total Purchase Value

* Average Purchase Total per Person by Age Group

In [29]:
ageBins = [0,10,15,20,24,32,40,100]
ageCategory = ["<10","10-14","15-19","20-24","25-32","33-40",">40"]
purchase_data['AgeBins'] = pd.cut(purchase_data['Age'],labels = ageCategory , bins = ageBins)
purchase_data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,AgeBins
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,15-19
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,33-40
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
...,...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,15-19
778,778,Sisur91,7,Male,92,Final Critic,4.19,<10
779,779,Ennrian78,24,Male,50,Dawn,4.60,20-24

In [30]:
# Create a Groupby object frist then break down the problem.
# Purchase Count
# Average Purchase Price
pC = purchase_data[['AgeBins','Price']].groupby('AgeBins')
pC

In [31]:
# Purchase Count
pC.count()

         Price
AgeBins
<10         32
10-14       54
15-19      200
20-24      266
25-32      151
33-40       70
>40          7

In [32]:
# Average Purchase Price
# Average is mean in pandas 
pC.mean()

            Price
AgeBins
<10      3.405000
10-14    2.900000
15-19    3.107800
20-24    3.006541
25-32    2.980530
33-40    3.161714
>40      3.075714

In [33]:
# Total Purchase Value
# sum value
pC.sum()

          Price
AgeBins
<10      108.96
10-14    156.60
15-19    621.56
20-24    799.74
25-32    450.06
33-40    221.32
>40       21.53

In [34]:
player_by_group = purchase_data['AgeBins'].value_counts()
player_by_group

20-24    266
15-19    200
25-32    151
33-40     70
10-14     54
<10       32
>40        7
Name: AgeBins, dtype: int64

In [35]:
# Average Purchase Total per Person by Age Group
pC.sum()['Price']/player_by_group

<10      3.405000
10-14    2.900000
15-19    3.107800
20-24    3.006541
25-32    2.980530
33-40    3.161714
>40      3.075714
dtype: float64

## Purchasing Analysis (Age)

# Top Spenders

* Identify the the top 5 spenders in the game by total purchase value, then list (in a table):

In [36]:
#Create a Groupby object frist then break down the problem.

Tp = purchase_data[['SN', 'Price']].groupby('SN')
Tp

In [37]:
Tp.sum().sort_values('Price', ascending=False).head(5)

             Price
SN
Lisosia93    18.96
Idastidru52  15.45
Chamjask73   13.83
Iral74       13.62
Iskadarya95  13.10

## Top Spenders

  * SN
  * Purchase Count
  * Average Purchase Price
  * Total Purchase Value

In [38]:
import numpy as np

In [39]:
Tp5 = purchase_data[['SN', 'Price']].groupby('SN').agg({'Price':['count','sum','mean']})
Tp5.sort_values(('Price',  'sum'), ascending = False).head(5)

            Price
            count    sum      mean
SN
Lisosia93       5  18.96  3.792000
Idastidru52     4  15.45  3.862500
Chamjask73      3  13.83  4.610000
Iral74          4  13.62  3.405000
Iskadarya95     3  13.10  4.366667

In [40]:
Tp5.columns

MultiIndex([('Price', 'count'),
            ('Price',   'sum'),
            ('Price',  'mean')],
           )

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [50]:
Mpi = purchase_data[["Item ID", "Item Name", "Price"]].groupby(["Item Name", "Item ID"]).agg({'Price':['count','sum','mean']})
Mpi

                                        Price
                                        count    sum  mean
Item Name                       Item ID
Abyssal Shard                   162         5  13.35  2.67
Aetherius, Boon of the Blessed  137         5  16.95  3.39
Agatha                          120         6  18.48  3.08
Alpha                           130         3   6.21  2.07
Alpha, Oath of Zeal             79          3  12.15  4.05
...                                       ...    ...   ...
Wolf                            60          8  28.32  3.54
Wolf, Promise of the Moonwalker 179         6  26.88  4.48
Worldbreaker                    112         4  10.40  2.60
Yearning Crusher                74          3  12.54  4.18
Yearning Mageblade              114         5  19.10  3.82

[179 rows x 3 columns]

In [54]:
most_Popular = Mpi.sort_values(("Price","count"), ascending = False).head(5)
most_Popular

                                                     Price
                                                     count    sum      mean
Item Name                                    Item ID
Final Critic                                 92         13  59.99  4.614615
Oathbreaker, Last Hope of the Breaking Storm 178        12  50.76  4.230000
Persuasion                                   132         9  28.99  3.221111
Nirvana                                      82          9  44.10  4.900000
Extraction, Quickblade Of Trembling Hands    108         9  31.77  3.530000

In [55]:
Prof = Mpi.sort_values(("Price","sum"), ascending = False).head(5)
Prof

                                                     Price
                                                     count    sum      mean
Item Name                                    Item ID
Final Critic                                 92         13  59.99  4.614615
Oathbreaker, Last Hope of the Breaking Storm 178        12  50.76  4.230000
Nirvana                                      82          9  44.10  4.900000
Fiery Glass Crusader                         145         9  41.22  4.580000
Singed Scalpel                               103         8  34.80  4.350000

Index(['Purchase ID', 'SN', 'Age', 'Gender', 'Item ID', 'Item Name', 'Price',
       'AgeBins'],
      dtype='object')

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame